Конфигурация/DataProcessors/КонтрольСЧА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>КонтрольСЧА</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодКонтроля</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РезультатыПроверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегистрацияСтоимостиАктивов</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РегистрацияСтоимостиАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СЧА_Расчетная</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РСА_Расчетная</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресВХранилище</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРасчетаСЧА</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеРассчитанаСЧА</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеЗаданыНастройки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РСА_Текущая</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СЧА_Текущая</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СЧА_СуммаАктивов</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РСА_СуммаАктивов</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИднетификаторРезультата</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация/InformationRegisters/ХранилищеЗначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ХранилищеЗначений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ХранилищеЗначения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУдалять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыОтбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>90</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/DataProcessors/КонтрольСЧА/Forms/Форма/Ext/Form/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.ЭтоПолноправныйПользователь = РаботаСПользователями.ЭтоПолноправныйПользователь();
	
	Элементы.КоличествоПараллельныхСеансов.Видимость = ЭтаФорма.ЭтоПолноправныйПользователь;
	Элементы.Организация.Видимость = ЭтаФорма.ЭтоПолноправныйПользователь;
	Элементы.СчетаДоверительногоУправленияКонтекстноеМенюЗаполнитьИзЗапроса.Видимость = ЭтаФорма.ЭтоПолноправныйПользователь;
	Элементы.ОрганизацияНадпись.Видимость = Не ЭтаФорма.ЭтоПолноправныйПользователь;
		
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	ЭтаФорма.КоличествоПараллельныхСеансов = 3;
	
	Если Не ЭтаФорма.ЭтоПолноправныйПользователь Тогда
		Элементы.РежимОтбора.СписокВыбора.Удалить(Элементы.РежимОтбора.СписокВыбора.НайтиПоЗначению(0));
		Элементы.РежимОтбора.СписокВыбора.Удалить(Элементы.РежимОтбора.СписокВыбора.НайтиПоЗначению(4));
		ЭтаФорма.РежимОтбора = 1;
	КонецЕсли; 
	
	ПоказатьДлительнуюОперацию(ЭтаФорма, Ложь);
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ЭтаФорма.ИдентификаторЗадания) Тогда
		
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		Если Не ЗавершениеРаботы Тогда
		
			Оповещение = Новый ОписаниеОповещения("ВопросОтменитьВыполнениеЗавершение", ЭтотОбъект);
			ПоказатьВопрос(Оповещение, "Отменить выполнение контроля?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);	
			
		Иначе
			
			ТекстПредупреждения = "Сначала рекомендуется отменить выполнение контроля";
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ПустаяСтрока(ЭтаФорма.АдресЭлектроннойПочты) Тогда
		ЭтаФорма.АдресЭлектроннойПочты = ПолучитьАдресЭлектроннойПочтыТекущегоПользователя();	
	КонецЕсли;
	
	ПриИзмененииПараметровОтправкиРезультатовНаПочту();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);

КонецПроцедуры

#КонецОбласти 

#Область Команды_формы

&НаКлиенте
Процедура КомандаВыполнитьКонтроль(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;	
	КонецЕсли;
	
	Если Объект.РезультатыПроверки.Количество() > 0 Тогда
		
		ПоляДляОчистки = Новый Массив;
		ПоляДляОчистки.Добавить("Статус");
		ПоляДляОчистки.Добавить("ЕстьОшибки");
		ПоляДляОчистки.Добавить("ЕстьОшибкиВЦБ");
		ПоляДляОчистки.Добавить("ЕстьОшибкиВАктивах");
		ПоляДляОчистки.Добавить("ЕстьОшибкиЗарегистрированныхЗначений");
		ПоляДляОчистки.Добавить("СЧА_Расчетная");
		ПоляДляОчистки.Добавить("РСА_Расчетная");
		ПоляДляОчистки.Добавить("РСА_Текущая");
		ПоляДляОчистки.Добавить("СЧА_Текущая");
		
		Для каждого ТекСтрока Из Объект.РезультатыПроверки Цикл
			Для каждого Поле Из ПоляДляОчистки Цикл
				ТекСтрока[Поле] = Неопределено;
			КонецЦикла; 
			ТекСтрока.ИднетификаторРезультата = Новый УникальныйИдентификатор;
		КонецЦикла; 
		
		ПодключитьОбработчикОжидания("ПроверитьСостояниеЗаданий", 5);
		ПоказатьДлительнуюОперацию(ЭтаФорма, Истина);
		ЗапуститьКонтрольНаСервере();
		
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОрганизациюПриНесоответствииОтбора()

	Если Не (ЭтаФорма.ЭтоПолноправныйПользователь И ЗначениеЗаполнено(Объект.Организация)) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.РежимОтбора = 2 Тогда
		ПроверкаПройдена = ВыбранныеСчетаСоответствуютОрганизации(ЭтаФорма.ОтборСчетаДУ, Объект.Организация);
	ИначеЕсли ЭтаФорма.РежимОтбора = 4 Тогда
		ПроверкаПройдена = ВыбранныеСчетаСоответствуютОрганизации(ЭтаФорма.АдресРезультатаОтбора, Объект.Организация);
	Иначе
		ПроверкаПройдена = Истина;
	КонецЕсли;
	
	Если Не ПроверкаПройдена Тогда
		
		ТекстВопроса = ?(ЭтаФорма.ОтборСчетаДУВСписке, "В списке присутствуют счета ДУ, не принадлежащие ", "Выбран счет ДУ, не принадлежащий ")
			+ "организации '" + Объект.Организация + "', контроль по таким счетам не выполняется.
			|Отключить отбор по организации?";
			
		Если Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			Объект.Организация = Неопределено;
		КонецЕсли;
		
	КонецЕсли; 
	 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыбранныеСчетаСоответствуютОрганизации(Отбор, Организация)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Если ЭтоАдресВременногоХранилища(Отбор) Тогда
		
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ДанныеОтбора.СчетДоверительногоУправления КАК СчетДоверительногоУправления
			|ПОМЕСТИТЬ _ДанныеОтбора
			|ИЗ
			|	&ДанныеОтбора КАК ДанныеОтбора
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СчетаДоверительногоУправления.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеОтбора КАК _ДанныеОтбора
			|		ПО (_ДанныеОтбора.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка)
			|ГДЕ
			|	СчетаДоверительногоУправления.Организация <> &Организация";
		
		Запрос.УстановитьПараметр("ДанныеОтбора", ПолучитьИзВременногоХранилища(Отбор));
		
	Иначе
	
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СчетаДоверительногоУправления.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
			|ГДЕ
			|	СчетаДоверительногоУправления.Ссылка В(&Ссылка)
			|	И СчетаДоверительногоУправления.Организация <> &Организация";
		
		Запрос.УстановитьПараметр("Ссылка", Отбор);
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Пустой()

КонецФункции

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	
	ЗаполнитьТаблицуДокументов();	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуДокументов(ИзмененОтбор = Ложь)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;	
	КонецЕсли;
	
	// Если заполнение из запроса, то при изменении отборов запрос повторно не выполняем
	
	Если ЭтаФорма.РежимОтбора = 4
		И Не (ИзмененОтбор И ДанныеЗапросаПолучены(ЭтаФорма.АдресРезультатаОтбора))
	Тогда
	
		Если Не ЗаполнитьОтборИзЗапроса() Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
		
	ОчиститьОрганизациюПриНесоответствииОтбора();
	
	Если ЗаполнитьТаблицуДокументовНаСервере() Тогда
		ЗаполнитьРезультатыПроверкиНаличияДокументов();
		ОтключитьОтборы();
	Иначе
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьТаблицуДокументовЗавершение", ЭтаФорма);
		ТекстВопроса = "По установленным отборам будет добавлено более 1000 элементов для выполнения контроля. Продолжить?";
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуДокументовЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьТаблицуДокументовНаСервере(Истина);
		ЗаполнитьРезультатыПроверкиНаличияДокументов();
		ОтключитьОтборы();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОтборы()

	Элементы.РезультатыПроверки.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура);
	
	Для Каждого ЭлементМеню Из Элементы.РезультатыПроверкиГруппаСкрытьСтроки.ПодчиненныеЭлементы Цикл
		ЭлементМеню.Пометка = Ложь;
	КонецЦикла;
	
	Элементы.РезультатыПроверкиГруппаСкрытьСтроки.Картинка = БиблиотекаКартинок.ОтборПоТекущемуЗначению;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРезультатыПроверкиНаличияДокументов()

	Для каждого ТекСтрока Из Объект.РезультатыПроверки Цикл
		
		ТекСтрока.ЕстьОшибки = Не ТекСтрока.ДатаРасчетаСЧА Или ТекСтрока.НеЗаданыНастройки Или ТекСтрока.НеРассчитанаСЧА;
		ТекСтрока.Результат = ?(ТекСтрока.НеЗаданыНастройки, "Не заданы настройки", "") +
			?(Не ТекСтрока.ДатаРасчетаСЧА И Не ТекСтрока.НеЗаданыНастройки, "В этот день СЧА не рассчитывается", "") +
			?(ТекСтрока.НеРассчитанаСЧА, "СЧА не рассчитана", "");
	
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура КомандаСкрытьСтрокиБезРасхождений(Команда)
	
	УстановитьПометкуМенюСокрытияСтрокБезРасхождений(Элементы.РезультатыПроверкиСкрытьСтрокиБезРасхождений);

	УстановитьОтборСтрокБезРасхождений();	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСкрытьСтрокиБезРасхожденийВАктивах(Команда)
	
	УстановитьПометкуМенюСокрытияСтрокБезРасхождений(Элементы.РезультатыПроверкиСкрытьСтрокиБезРасхожденийВАктивах);
	
	УстановитьОтборСтрокБезРасхождений();	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСкрытьСтрокиБезРасхожденийВЦБ(Команда)

	УстановитьПометкуМенюСокрытияСтрокБезРасхождений(Элементы.РезультатыПроверкиСкрытьСтрокиБезРасхожденийВЦБ);
	
	УстановитьОтборСтрокБезРасхождений();	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСкрытьСтрокиБезРасхожденийФинансовыхПоказателей(Команда)
	
	УстановитьПометкуМенюСокрытияСтрокБезРасхождений(Элементы.РезультатыПроверкиСкрытьСтрокиБезРасхожденийФинансовыхПоказателей);

	УстановитьОтборСтрокБезРасхождений();	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьСчетаДУИзЗапроса(Команда)
	
	ИмяОбъекта	= Лев(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".", , , 2) - 1);
	Результат = ОткрытьФормуМодально(ИмяОбъекта + ".Форма.РедакторТекстаЗапроса", Новый Структура("ТекстЗапроса", ЭтаФорма.ТекстЗапроса), ЭтаФорма);
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ЭтаФорма.ТекстЗапроса = Результат.ТекстЗапроса;
		ЭтаФорма.ОтборСчетаДУ.ЗагрузитьЗначения(Результат.СчетаДоверительногоУправления);
		ОтборСчетаДУСписокПриИзменении(Неопределено);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтменитьВыполнениеКонтроля(Команда)
	
	ОтключитьОбработчикОжидания("ПроверитьСостояниеЗаданий");
	ЗавершитьЗаданияНаСервере(ЭтаФорма.ИдентификаторЗадания);
	ЭтаФорма.ИдентификаторЗадания = Неопределено;
	ПоказатьДлительнуюОперацию(ЭтаФорма, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьРезультатыВФайл(Команда)

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.ПолноеИмяФайла	= "КонтрольСЧА_" + Формат(Объект.ПериодКонтроля.ДатаНачала, "ДФ=dd.MM.yyyy") + "_" + Формат(Объект.ПериодКонтроля.ДатаОкончания, "ДФ=dd.MM.yyyy") + ".xml";
	Диалог.Фильтр			= "Файлы XML (*.xml)|*.xml|Все файлы (*.*)|*.*";
	
	Если Диалог.Выбрать() Тогда	
		
		ДанныеФайла	= ПолучитьРезультатыПроверкиВоВнутреннемФормате();
		
		Если ДанныеФайла <> Неопределено Тогда
			
			ТекстовыйДокумент = Новый ТекстовыйДокумент;
			ТекстовыйДокумент.УстановитьТекст(ДанныеФайла);
			ТекстовыйДокумент.Записать(Диалог.ПолноеИмяФайла, КодировкаТекста.UTF8);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВосстановитьРезультатыИзФайла(Команда)

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Файлы XML (*.xml)|*.xml|Все файлы (*.*)|*.*";
	
	Если Диалог.Выбрать() Тогда	
		
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.Прочитать(Диалог.ПолноеИмяФайла, КодировкаТекста.UTF8);
		
		ДанныеФайла	= ТекстовыйДокумент.ПолучитьТекст();
		
		ВосстановитьРезультатыПроверкиИзДанныхВнутреннегоФормата(ДанныеФайла);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечать(Команда)

	Печать();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьТолькоРасхожденийВЦБ(Команда)

	Печать("ОтличияЦБ");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьТолькоРасхожденийВАктивах(Команда)

	Печать("ОтличияАктивов");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьТолькоРасхожденийВДоходности(Команда)
	
	Печать("ОтличияДоходности");
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаПечатьТолькоРасхожденийВЦБКИД(Команда)
	
	Печать("ОтличияПрочихЦБ");
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(НаборРасхождений = Неопределено)
	
	ИдентификаторыСтрок = Новый Массив;
	
	Для Каждого ТекСтрока Из Объект.РезультатыПроверки Цикл
		ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
		Если ТекСтрока.ЕстьОшибки И Элементы.РезультатыПроверки.ПроверитьСтроку(ИдентификаторСтроки) Тогда
			ИдентификаторыСтрок.Добавить(ИдентификаторСтроки);		
		КонецЕсли;
	КонецЦикла;
		
	ДокументРезультат = СформироватьТабличныйДокументСРезультатамиПроверки(ИдентификаторыСтрок, НаборРасхождений);
	
	Если ДокументРезультат <> Неопределено Тогда
		
		ДокументРезультат.Показать("Результаты проверки СЧА");	
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура РезультатыПроверкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекСтрока = Объект.РезультатыПроверки.НайтиПоИдентификатору(ВыбраннаяСтрока);
	СтандартнаяОбработка = Ложь;
	
	Если Поле.Имя = "РезультатыПроверкиСчетДоверительногоУправления" Тогда
		ОткрытьЗначение(ТекСтрока.СчетДоверительногоУправления);
	ИначеЕсли Поле.Имя = "РезультатыПроверкиРегистрацияСтоимостиАктивов" Тогда
		ОткрытьЗначение(ТекСтрока.РегистрацияСтоимостиАктивов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатыПроверкиПриАктивизацииСтроки(Элемент)
	
	Если Не Элементы.РезультатыПроверки.ТекущаяСтрока = Неопределено Тогда
		ТекСтрока = Объект.РезультатыПроверки.НайтиПоИдентификатору(Элементы.РезультатыПроверки.ТекущаяСтрока);
		ЭтаФорма.ТабличныйДокумент = СформироватьТабличныйДокумент(ТекСтрока.АдресВХранилище);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьРезультатыНаПочтуПриИзменении(Элемент)

	ПриИзмененииПараметровОтправкиРезультатовНаПочту();
	
КонецПроцедуры

&НаКлиенте
Процедура АдресЭлектроннойПочтыПриИзменении(Элемент)

	ПриИзмененииПараметровОтправкиРезультатовНаПочту();
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьРезультатыПроверкиНаПочту()
	
	Вложения		= Новый Соответствие;
	ВременныеФайлы	= Новый Массив;	
	
	// Формируем отчет	
	
	Попытка
		
		ДанныеОтчета = СформироватьТабличныйДокументСРезультатамиПроверки();
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
		
		ДанныеОтчета.Записать(ИмяВременногоФайла,  ТипФайлаТабличногоДокумента.XLSX);
		
		Вложения.Вставить("Отчет.xlsx", Новый Файл(ИмяВременногоФайла));
		
		ВременныеФайлы.Добавить(ИмяВременногоФайла);
		
	Исключение
		
		ЗаписьЖурналаРегистрации("Ошибка формирования отчета", УровеньЖурналаРегистрации.Ошибка, , Метаданные.Обработки.КонтрольСЧА.ПолноеИмя(), ОписаниеОшибки());
		
	КонецПопытки;
	
	// Формируем данные во внутреннем формате
	
	Попытка
		
		ДанныеФайла	= ПолучитьРезультатыПроверкиВоВнутреннемФормате();
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
		
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.УстановитьТекст(ДанныеФайла);
		ТекстовыйДокумент.Записать(ИмяВременногоФайла, КодировкаТекста.UTF8);
		
		Вложения.Вставить("Служебный.xml", Новый Файл(ИмяВременногоФайла));
		
		ВременныеФайлы.Добавить(ИмяВременногоФайла);
		
	Исключение
		
		ЗаписьЖурналаРегистрации("Ошибка формирования файла во внутреннем формате", УровеньЖурналаРегистрации.Ошибка, , Метаданные.Обработки.КонтрольСЧА.ПолноеИмя(), ОписаниеОшибки());
		
	КонецПопытки;
	
	// Высылаем на почту	
	
	Если ЭтаФорма.РежимОтбора = 0 Тогда
		ПредставлениеОтбора = "всем клиентам";
	ИначеЕсли ЭтаФорма.РежимОтбора = 1 Тогда
		ПредставлениеОтбора = Строка(ЭтаФорма.ОтборВидыДоговоровДУ);
	ИначеЕсли ЭтаФорма.РежимОтбора = 2 Тогда
		ПредставлениеОтбора = Строка(ЭтаФорма.ОтборСчетаДУ);
	ИначеЕсли ЭтаФорма.РежимОтбора = 3 Тогда
		ПредставлениеОтбора = Строка(ЭтаФорма.ОтборКлиенты);
	Иначе
		ПредставлениеОтбора = Неопределено;
	КонецЕсли; 
		
	Попытка
		
		РаботаСЭлектроннойПочтой.ОтправитьПростоеЭлектронноеПисьмо(
			ЭтаФорма.АдресЭлектроннойПочты,
			"Контроль СЧА за период " + Строка(Объект.ПериодКонтроля) + " по " + ПредставлениеОтбора,
			"Результаты проверки СЧА за период " + Строка(Объект.ПериодКонтроля) + " по " + ПредставлениеОтбора,
			Вложения,
			РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись(),
			Ложь
		);
		
	Исключение
		
		ЗаписьЖурналаРегистрации("Ошибка отправки отчета на электронную почту", УровеньЖурналаРегистрации.Ошибка, , Метаданные.Обработки.КонтрольСЧА.ПолноеИмя(), ОписаниеОшибки());
		
	КонецПопытки;	
	
	// Удаляем не нужные файлы	
	
	Для Каждого ВременныйФайл Из ВременныеФайлы Цикл
		УдалитьФайлы(ВременныйФайл);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если ЭтаФорма.РежимОтбора = 4 Тогда
		ОчиститьРезультатыПроверки();
	КонецЕсли;
	
	ЗаполнитьТаблицуДокументов(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОтбораПриИзменении(Элемент)
	
	Элементы.РежимОтбора.ОтображениеПодсказки = ?(ЭтаФорма.РежимОтбора = 4, ОтображениеПодсказки.Кнопка, ОтображениеПодсказки.Нет);
	
	Элементы.ГруппаОтборВидыДоговоровДУ.Видимость 	= ЭтаФорма.РежимОтбора = 1;
	Элементы.ГруппаОтборСчетаДУ.Видимость 			= ЭтаФорма.РежимОтбора = 2;
	Элементы.ГруппаОтборКлиенты.Видимость 			= ЭтаФорма.РежимОтбора = 3;
	
	ПриИзмененииВидаОтбора("ВидыДоговоровДУ");
	ПриИзмененииВидаОтбора("СчетаДУ");
	ПриИзмененииВидаОтбора("Клиенты");

	Если ЭтаФорма.РежимОтбора <> 4 Тогда
		ЗаполнитьТаблицуДокументов(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВидыДоговоровДУВСпискеПриИзменении(Элемент)
	
	ПриИзмененииВидаОтбора("ВидыДоговоровДУ");
	
	ЗаполнитьТаблицуДокументов(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСчетаДУВСпискеПриИзменении(Элемент)
	
	ПриИзмененииВидаОтбора("СчетаДУ");
	
	ЗаполнитьТаблицуДокументов(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКлиентыВСпискеПриИзменении(Элемент)
	
	ПриИзмененииВидаОтбора("Клиенты");
	
	ЗаполнитьТаблицуДокументов(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодКонтроляПриИзменении(Элемент)
	
	Если ЭтаФорма.РежимОтбора = 4 Тогда
		ОчиститьРезультатыПроверки();
	КонецЕсли;
	
	ЗаполнитьТаблицуДокументов(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВидыДоговоровДУПриИзменении(Элемент)
	
	ЗаполнитьТаблицуДокументов(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВидыДоговоровДУСписокПриИзменении(Элемент)
	
	ЗаполнитьТаблицуДокументов(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСчетаДУПриИзменении(Элемент)
	
	ЗаполнитьТаблицуДокументов(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСчетаДУСписокПриИзменении(Элемент)
	
	ЗаполнитьТаблицуДокументов(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКлиентыПриИзменении(Элемент)
	
	ЗаполнитьТаблицуДокументов(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКлиентыСписокПриИзменении(Элемент)
	
	ЗаполнитьТаблицуДокументов(Истина);
	
КонецПроцедуры

#КонецОбласти 

#Область Служебные_процедуры_и_функции

&НаКлиенте
Процедура ПриИзмененииВидаОтбора(ИмяВидаОтбора)

	ИмяРеквизитаВидОтбора = "Отбор" + ИмяВидаОтбора + "ВСписке";
	ИмяЭлемента = "Отбор" + ИмяВидаОтбора;
	ИмяЭлементаСписок = "Отбор" + ИмяВидаОтбора + "Список";
	
	ВидОтбораВСписке = ЭтаФорма[ИмяРеквизитаВидОтбора];
	
	Элементы[ИмяЭлемента].Видимость = Не ВидОтбораВСписке;
	Элементы[ИмяЭлементаСписок].Видимость = ВидОтбораВСписке;
	
	Если Не ВидОтбораВСписке Тогда
		
		КоличествоЭлементов = ЭтаФорма[ИмяЭлемента].Количество();
		
		Если КоличествоЭлементов = 0 Тогда
			// добавим первую строку
			ЭтаФорма[ИмяЭлемента].Добавить();
		ИначеЕсли КоличествоЭлементов > 1 Тогда
			Для Индекс = -(КоличествоЭлементов - 1) По -1 Цикл
				// удалим все элементы, кроме первого
				ЭтаФорма[ИмяЭлемента].Удалить(-Индекс);
			КонецЦикла; 
		КонецЕсли; 
	
	КонецЕсли; 

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПоказатьДлительнуюОперацию(ЭтаФорма, Показать)
	
	ЭтаФорма.Элементы.ФормаКомандаВыполнитьКонтроль.Видимость = Не Показать;
	ЭтаФорма.Элементы.КомандаОтменитьВыполнениеКонтроля.Видимость = Показать;
	
	ЭтаФорма.Элементы.ГруппаПараметры.Доступность = Не Показать;
	ЭтаФорма.Элементы.ГруппаОрганизация.Доступность = Не Показать;
	ЭтаФорма.Элементы.ГруппаОтбор.Доступность = Не Показать;
	ЭтаФорма.Элементы.РезультатыПроверкиКомандаЗаполнить.Доступность = Не Показать;
	ЭтаФорма.Элементы.РезультатыПроверкиКомандаВосстановитьРезультатыИзФайла.Доступность = Не Показать;
	
КонецПроцедуры

&НаСервере
Процедура ЗапуститьКонтрольНаСервере()
		
	ТабличныйДокумент.Очистить();
	
	ИмяПодчиненныхЗаданий = "Обработки.КонтрольСЧА.ВыполнитьПроверку_" + ПолучитьТекущийСеансИнформационнойБазы().НомерСеанса;
	
	ПараметрыОбработки = Новый Структура("ТаблицаДляПроверки, КоличествоПараллельныхСеансов, ИмяПодчиненныхЗаданий", 
		Объект.РезультатыПроверки.Выгрузить(), 
		ЭтаФорма.КоличествоПараллельныхСеансов, 
		ИмяПодчиненныхЗаданий);
	
	СтруктураЗадания = РаботаСДлительнымиОперациями.ЗапуститьВыполнениеВФоне(ЭтаФорма.УникальныйИдентификатор, "Обработки.КонтрольСЧА.ПроверитьТаблицу", ПараметрыОбработки, , , Ложь);
	ЭтаФорма.ИдентификаторЗадания = СтруктураЗадания.ИдентификаторЗадания;
		
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСостояниеЗаданий()
	
	ЗаполнитьСостоянияЗаданийНаСервере();
	
	НезапущенныеЗадания	= Объект.РезультатыПроверки.НайтиСтроки(Новый Структура("Статус", ""));
	НезапущенныхЗаданий	= НезапущенныеЗадания.Количество();
	
	ТекущаяСтрока = Элементы.РезультатыПроверки.ТекущиеДанные;
	
	Если Не ТекущаяСтрока = Неопределено И ЗначениеЗаполнено(ТекущаяСтрока.Статус) и ТекущаяСтрока.ЕстьОшибки И ЭтаФорма.ТабличныйДокумент.ВысотаТаблицы = 0 Тогда
		РезультатыПроверкиПриАктивизацииСтроки(Неопределено);
	КонецЕсли; 
	
	Если НезапущенныхЗаданий = 0 Тогда 
		
		Состояние("Выполнение контроля СЧА завершено");
		ОтключитьОбработчикОжидания("ПроверитьСостояниеЗаданий");
		ОбработатьЗавершениеФоновыхЗаданий();
		ПоказатьДлительнуюОперацию(ЭтаФорма, Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСостоянияЗаданийНаСервере()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РезультатыПроверки", Объект.РезультатыПроверки.Выгрузить(, "ИднетификаторРезультата, Статус"));
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РезультатыПроверки.ИднетификаторРезультата КАК ИднетификаторРезультата
		|ПОМЕСТИТЬ _РезультатыПроверки
		|ИЗ
		|	&РезультатыПроверки КАК РезультатыПроверки
		|ГДЕ
		|	(ВЫРАЗИТЬ(РезультатыПроверки.Статус КАК СТРОКА(1024))) = """"
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ИднетификаторРезультата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ХранилищеЗначений.Идентификатор КАК Идентификатор,
		|	ХранилищеЗначений.ХранилищеЗначения КАК ХранилищеЗначения
		|ИЗ
		|	РегистрСведений.ХранилищеЗначений КАК ХранилищеЗначений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _РезультатыПроверки КАК _РезультатыПроверки
		|		ПО ХранилищеЗначений.Идентификатор = _РезультатыПроверки.ИднетификаторРезультата
		|			И (ХранилищеЗначений.Источник = ""КонтрольСЧА"")";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		ТекСтрока = Объект.РезультатыПроверки.НайтиСтроки(Новый Структура("ИднетификаторРезультата", Выборка.Идентификатор))[0];
		
		ЗначениеРезультат = Выборка.ХранилищеЗначения.Получить();
		
		Если ТипЗнч(ЗначениеРезультат) = Тип("Структура") И Не ЗначениеРезультат.Свойство("ТекстОшибки") Тогда
			
			ЗаполнитьЗначенияСвойств(ТекСтрока, ЗначениеРезультат);
			ТекСтрока.Статус = "Завершено";
			
			Если ЗначениеРезультат.Итоги.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(ТекСтрока, ЗначениеРезультат.Итоги[0]);
			КонецЕсли; 
						
			ТекСтрока.АдресВХранилище = ПоместитьВоВременноеХранилище(ЗначениеРезультат, ЭтаФорма.УникальныйИдентификатор);
			ТекСтрока.ЕстьОшибкиЗарегистрированныхЗначений = ЗначениеРезультат.ЕстьОшибкиЗарегистрированныхЗначений;
			
			Если ЗначениеРезультат.ОтличияЦБ.Количество() <> 0 Тогда
				ТекСтрока.ЕстьОшибкиВЦБ = Истина;
			КонецЕсли;
			
			Если ЗначениеРезультат.ОтличияАктивов.Количество() <> 0 Тогда
				ТекСтрока.ЕстьОшибкиВАктивах = Истина;
			КонецЕсли;
			
			Если Не ТекСтрока.ДатаРасчетаСЧА Тогда
				ТекСтрока.Результат = ?(ТекСтрока.НеЗаданыНастройки, "Не заданы настройки формирования СЧА", "В этот день СЧА не рассчитывается");
				ТекСтрока.ЕстьОшибки = Истина;
			ИначеЕсли ТекСтрока.НеЗаданыНастройки Тогда
				ТекСтрока.Результат = "Не заданы настройки формирования СЧА";
				ТекСтрока.ЕстьОшибки = Истина;
			ИначеЕсли ТекСтрока.ЕстьОшибкиЗарегистрированныхЗначений Или ТекСтрока.ЕстьОшибкиВЦБ Или ТекСтрока.ЕстьОшибкиВАктивах Тогда
				ТекСтрока.Результат = "Есть расхождения" + ?(ТекСтрока.НеЗаданыНастройки, " (настройки не заданы)", "");
				ТекСтрока.ЕстьОшибки = Истина;
			Иначе
				ТекСтрока.Результат = "Нет расхождений" + ?(ТекСтрока.НеЗаданыНастройки, " (настройки не заданы)", "");
				ТекСтрока.ЕстьОшибки = ТекСтрока.НеЗаданыНастройки;
			КонецЕсли; 				
			
		Иначе
		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось выполнить контроль по клиенту %1 за %2", ТекСтрока.СчетДоверительногоУправления, Формат(ТекСтрока.Дата, "ДФ=dd.MM.yyyy")));
			
			ТекСтрока.Статус = "Завершено аварийно";
			ТекСтрока.ЕстьОшибки = Истина;
			
			Если ТипЗнч(ЗначениеРезультат) = Тип("Строка") Тогда
				ТекСтрока.Результат = ЗначениеРезультат;
			ИначеЕсли ТипЗнч(ЗначениеРезультат) = Тип("Структура") И ЗначениеРезультат.Свойство("ТекстОшибки") Тогда
				ТекСтрока.Результат = ЗначениеРезультат.ТекстОшибки;
			Иначе
				ТекСтрока.Результат = "Завершено аварийно";
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ЭтаФорма.ИдентификаторЗадания);
	Если ФоновоеЗадание = Неопределено Или ФоновоеЗадание.Состояние <> СостояниеФоновогоЗадания.Активно Тогда
		// работа задания прекращена, обновим статус для оставшихся строк
		НайденныеСтроки = Объект.РезультатыПроверки.НайтиСтроки(Новый Структура("Статус", ""));
		Для каждого ТекСтрока Из НайденныеСтроки Цикл
			ТекСтрока.Статус = "Завершено аварийно";
			ТекСтрока.ЕстьОшибки = Истина;
			ТекСтрока.Результат = "Контроль не выполнен";
		КонецЦикла; 
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура ОбработатьЗавершениеФоновыхЗаданий()
	
	ОбработатьРезультат();
		
	ЭтаФорма.ИдентификаторЗадания = Неопределено;
	
	Если ЭтаФорма.ОтправитьРезультатыНаПочту И ЗначениеЗаполнено(ЭтаФорма.АдресЭлектроннойПочты) Тогда
		ОтправитьРезультатыПроверкиНаПочту();		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультат()

	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ЭтаФорма.ИдентификаторЗадания);	
	Если Задание <> Неопределено Тогда
		МассивСообщений = Задание.ПолучитьСообщенияПользователю(Истина);
		Для Каждого Сообщение Из МассивСообщений Цикл
			Если Не СтрНачинаетсяС(Сообщение.Текст, "ИмяПодичненныхЗаданий_") Тогда
				Сообщение.Сообщить();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьОтборИзЗапроса()
	
	Если Не ЭтоАдресВременногоХранилища(ЭтаФорма.АдресРезультатаОтбора) Тогда
		ЭтаФорма.АдресРезультатаОтбора = ПоместитьВоВременноеХранилище(Неопределено, ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	
	Если Не ЭтоАдресВременногоХранилища(ЭтаФорма.АдресПараметровЗапросаПроверяемыхДанных) Тогда
		ЭтаФорма.АдресПараметровЗапросаПроверяемыхДанных = ПоместитьВоВременноеХранилище(Неопределено, ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	
	ИмяОбъекта		= Лев(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".", , , 2) - 1);
	ПолноеИмяФормы	= ИмяОбъекта + ".Форма.РедакторТекстаЗапроса";
	
	ПараметрыФормы	= Новый Структура;
	ПараметрыФормы.Вставить("ТекстЗапроса",			  ЭтаФорма.ТекстЗапросаПроверяемыхДанных);
	ПараметрыФормы.Вставить("АдресРезультатаЗапроса", ЭтаФорма.АдресРезультатаОтбора);
	ПараметрыФормы.Вставить("АдресПараметровЗапроса", ЭтаФорма.АдресПараметровЗапросаПроверяемыхДанных);
	ПараметрыФормы.Вставить("ОбязательныеПоля",		  "Период, СчетДоверительногоУправления");
	
	Результат = ОткрытьФормуМодально(ПолноеИмяФормы, ПараметрыФормы, ЭтаФорма);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат Ложь;	
	КонецЕсли;			
	
	ЭтаФорма.ТекстЗапросаПроверяемыхДанных				= Результат.ТекстЗапроса;
	ЭтаФорма.АдресПараметровЗапросаПроверяемыхДанных	= Результат.АдресПараметровЗапроса;
	ЭтаФорма.АдресРезультатаОтбора						= Результат.АдресРезультатаЗапроса;	
	
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеЗапросаПолучены(АдресРезультатаОтбора)
	
	Если Не ЭтоАдресВременногоХранилища(АдресРезультатаОтбора) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеЗапроса = ПолучитьИзВременногоХранилища(АдресРезультатаОтбора);
	
	Возврат (ДанныеЗапроса <> Неопределено);
	
КонецФункции

&НаСервере
Функция ЗаполнитьТаблицуДокументовНаСервере(ЗагрузитьТаблицуДокументовИзХранилища = Ложь)

	Если Не ЗагрузитьТаблицуДокументовИзХранилища Тогда
	
		Отбор = Новый Структура("ОтборВидыДоговоровДУ, ОтборСчетаДУ, ОтборКлиенты, АдресРезультатаОтбора", 
			ЭтаФорма.ОтборВидыДоговоровДУ,
			ЭтаФорма.ОтборСчетаДУ,
			ЭтаФорма.ОтборКлиенты,
			ЭтаФорма.АдресРезультатаОтбора);
			
		РезультатыПроверки = Обработки.КонтрольСЧА.ПолучитьТаблицуКонтроляСЧА(Объект.Организация, Объект.ПериодКонтроля, ЭтаФорма.РежимОтбора, Отбор);
		
		Если РезультатыПроверки.Количество() > 1000 Тогда
			
			ЭтаФорма.АдресТаблицыДокументов = ПоместитьВоВременноеХранилище(РезультатыПроверки, ЭтаФорма.УникальныйИдентификатор);
			Возврат Ложь;
		
		КонецЕсли; 
		
	Иначе
		
		РезультатыПроверки = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресТаблицыДокументов);
		УдалитьИзВременногоХранилища(ЭтаФорма.АдресТаблицыДокументов);
		
	КонецЕсли; 
	
	ОчиститьРезультатыПроверки();
	Объект.РезультатыПроверки.Загрузить(РезультатыПроверки);
	
	Возврат Истина;
	
КонецФункции
 	
&НаСервереБезКонтекста
Функция СформироватьТабличныйДокумент(АдресВХранилище)
	
	Если ЭтоАдресВременногоХранилища(АдресВХранилище) Тогда
	
		НаборыДанных = ПолучитьИзВременногоХранилища(АдресВХранилище);
		
		Возврат Обработки.КонтрольСЧА.СформироватьТабличныйДокумент(НаборыДанных);
		
	КонецЕсли; 
	
КонецФункции

&НаКлиенте
Процедура ВопросОтменитьВыполнениеЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ЗавершитьЗаданияНаСервере(ЭтаФорма.ИдентификаторЗадания);
		ЭтаФорма.ИдентификаторЗадания = Неопределено;
		ЭтаФорма.Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗавершитьЗаданияНаСервере(ИдентификаторЗадания)

	ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	Если ФоновоеЗадание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивСообщений = ФоновоеЗадание.ПолучитьСообщенияПользователю(Истина);
	
	ИмяПодчиненныхЗаданий = "";
	Для каждого Сообщение Из МассивСообщений Цикл
	
		Если СтрНачинаетсяС(Сообщение.Текст, "ИмяПодичненныхЗаданий_") Тогда
			
			ИмяПодчиненныхЗаданий = СтрЗаменить(Сообщение.Текст, "ИмяПодичненныхЗаданий_", "");
			Прервать;
		
		КонецЕсли; 
	
	КонецЦикла; 
	
	РаботаСДлительнымиОперациями.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	
	Попытка
		ФоновоеЗадание.ОжидатьЗавершения();
	Исключение
	КонецПопытки;
	
	Если Не ИмяПодчиненныхЗаданий = "" Тогда
	
		МассивПодчиненных = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("Наименование, Статус", ИмяПодчиненныхЗаданий, СостояниеФоновогоЗадания.Активно));
		Для каждого ФоновоеЗадание Из МассивПодчиненных Цикл
		
			РаботаСДлительнымиОперациями.ОтменитьВыполнениеЗадания(ФоновоеЗадание.УникальныйИдентификатор);
		
		КонецЦикла; 
	
	КонецЕсли; 	

КонецПроцедуры

&НаСервере
Процедура ОчиститьРезультатыПроверки()
	
	Для Каждого ТекСтрока Из Объект.РезультатыПроверки Цикл
		Если ЭтоАдресВременногоХранилища(ТекСтрока.АдресВХранилище) Тогда
			УдалитьИзВременногоХранилища(ТекСтрока.АдресВХранилище);
		КонецЕсли; 
	КонецЦикла;
	
	Объект.РезультатыПроверки.Очистить();
	ЭтаФорма.ТабличныйДокумент.Очистить();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРезультатыПроверкиВоВнутреннемФормате()
	
	ТаблицаРезультатов = Объект.РезультатыПроверки.Выгрузить();
	ТаблицаРезультатов.Колонки.Добавить("НаборыДанных");
	
	Для Каждого ТекСтрока Из ТаблицаРезультатов Цикл
		Если ЗначениеЗаполнено(ТекСтрока.АдресВХранилище) Тогда
			ТекСтрока.НаборыДанных = ПолучитьИзВременногоХранилища(ТекСтрока.АдресВХранилище);
		Иначе
			ТекСтрока.НаборыДанных = Новый ТаблицаЗначений;
		КонецЕсли;		
	КонецЦикла;			
	
	СохраняемыеДанные = Новый Структура;
	СохраняемыеДанные.Вставить("ТаблицаРезультатов", 			ТаблицаРезультатов);
	СохраняемыеДанные.Вставить("ПериодКонтроля", 				Объект.ПериодКонтроля);
	СохраняемыеДанные.Вставить("СчетаДоверительногоУправления", ОтборСчетаДУ);
	
	Возврат XMLСтрока(Новый ХранилищеЗначения(СохраняемыеДанные, Новый СжатиеДанных(9)));
	
КонецФункции

&НаСервере
Процедура ВосстановитьРезультатыПроверкиИзДанныхВнутреннегоФормата(ДанныеФайла)
	
	// Очищаем
	ОчиститьРезультатыПроверки();
	
	// Подменяем
	СохраненныеДанные = XMLЗначение(Тип("ХранилищеЗначения"), ДанныеФайла).Получить();
	
	Объект.ПериодКонтроля	= СохраненныеДанные.ПериодКонтроля;	
	ОтборСчетаДУ			= СохраненныеДанные.СчетаДоверительногоУправления;	
	ТаблицаРезультатов		= СохраненныеДанные.ТаблицаРезультатов;
	
	//ЭтаФорма.СтруктураЗадания = Новый Структура("АдресХранилища, ИдентификаторЗадания", ПоместитьВоВременноеХранилище(ТаблицаРезультатов, ЭтаФорма.УникальныйИдентификатор), Новый УникальныйИдентификатор);
	
	// Заполняем
	//ОбработатьРезультат();
	Если ТипЗнч(ТаблицаРезультатов) = Тип("ТаблицаЗначений") Тогда
		
		Для Каждого ТекСтрока Из ТаблицаРезультатов Цикл
		
			НоваяСтрока = Объект.РезультатыПроверки.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			
			Если ТекСтрока.НаборыДанных <> Неопределено И ТекСтрока.НаборыДанных.Количество() <> 0 Тогда
				НоваяСтрока.АдресВХранилище = ПоместитьВоВременноеХранилище(ТекСтрока.НаборыДанных, ЭтаФорма.УникальныйИдентификатор);
				НоваяСтрока.ЕстьОшибкиЗарегистрированныхЗначений = ТекСтрока.НаборыДанных.ЕстьОшибкиЗарегистрированныхЗначений;
				Если ТекСтрока.НаборыДанных.ОтличияЦБ.Количество() <> 0 Тогда
					НоваяСтрока.ЕстьОшибкиВЦБ = Истина;
				КонецЕсли;
				
				Если ТекСтрока.НаборыДанных.ОтличияАктивов.Количество() <> 0 Тогда
					НоваяСтрока.ЕстьОшибкиВАктивах = Истина;
				КонецЕсли;				
			КонецЕсли;			
			
		КонецЦикла; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьТабличныйДокументСРезультатамиПроверки(ИдентификаторыСтрок = Неопределено, НаборРасхождений = Неопределено)
		
	Если ИдентификаторыСтрок <> Неопределено Тогда 
		ОтобранныеСтроки = Новый Массив;
		
		Для Каждого Идентификатор Из ИдентификаторыСтрок Цикл
			ОтобранныеСтроки.Добавить(Объект.РезультатыПроверки.НайтиПоИдентификатору(Идентификатор));
		КонецЦикла;
	КонецЕсли;	
	
	Если ТипЗнч(НаборРасхождений) = Тип("Строка") Тогда
		НаборРасхождений = Новый Структура(НаборРасхождений);		
	КонецЕсли;
	
	Клиенты = Объект.РезультатыПроверки.Выгрузить(ОтобранныеСтроки, "СчетДоверительногоУправления, Дата, Результат, РСА_Текущая, РСА_Расчетная, СЧА_Текущая, СЧА_Расчетная, АдресВХранилище");
	
	ОбщиеНаборыДанных = Новый Структура("Клиенты", Клиенты);
	
	Для Каждого ТекСтрока Из Клиенты Цикл
		
		Если ЭтоАдресВременногоХранилища(ТекСтрока.АдресВХранилище) Тогда

			НаборыДанных = ПолучитьИзВременногоХранилища(ТекСтрока.АдресВХранилище);

			РезультатПроверки = Новый Структура; 
			
			Если (НаборРасхождений = Неопределено ИЛИ НаборРасхождений.Свойство("ОтличияДоходности"))
			   И НаборыДанных.Свойство("ОтличияДоходности") Тогда
			   
				РезультатПроверки.Вставить("ОтличияДоходности", НаборыДанных.ОтличияДоходности.Скопировать());
				РезультатПроверки.ОтличияДоходности.Колонки.Добавить("СчетДоверительногоУправления", Клиенты.Колонки["СчетДоверительногоУправления"].ТипЗначения);
				РезультатПроверки.ОтличияДоходности.Колонки.Добавить("Дата", Клиенты.Колонки["Дата"].ТипЗначения);
				РезультатПроверки.ОтличияДоходности.ЗаполнитьЗначения(ТекСтрока.СчетДоверительногоУправления, "СчетДоверительногоУправления");
				РезультатПроверки.ОтличияДоходности.ЗаполнитьЗначения(ТекСтрока.Дата, "Дата");
				
				Если ОбщиеНаборыДанных.Свойство("ОтличияДоходности") Тогда
					РаботаСКоллекциями.ТаблицаЗначений_Дополнить(РезультатПроверки.ОтличияДоходности, ОбщиеНаборыДанных.ОтличияДоходности); 			
				Иначе
					ОбщиеНаборыДанных.Вставить("ОтличияДоходности", РезультатПроверки.ОтличияДоходности);	
				КонецЕсли;
			КонецЕсли;	
			
			Если НаборРасхождений = Неопределено ИЛИ НаборРасхождений.Свойство("ОтличияАктивов") Тогда
				РезультатПроверки.Вставить("ОтличияАктивов", НаборыДанных.ОтличияАктивов.Скопировать());
				РезультатПроверки.ОтличияАктивов.Колонки.Добавить("СчетДоверительногоУправления", Клиенты.Колонки["СчетДоверительногоУправления"].ТипЗначения);
				РезультатПроверки.ОтличияАктивов.Колонки.Добавить("Дата", Клиенты.Колонки["Дата"].ТипЗначения);
				РезультатПроверки.ОтличияАктивов.ЗаполнитьЗначения(ТекСтрока.СчетДоверительногоУправления, "СчетДоверительногоУправления");
				РезультатПроверки.ОтличияАктивов.ЗаполнитьЗначения(ТекСтрока.Дата, "Дата");
				
				Если ОбщиеНаборыДанных.Свойство("ОтличияАктивов") Тогда
					РаботаСКоллекциями.ТаблицаЗначений_Дополнить(РезультатПроверки.ОтличияАктивов, ОбщиеНаборыДанных.ОтличияАктивов); 			
				Иначе
					ОбщиеНаборыДанных.Вставить("ОтличияАктивов", РезультатПроверки.ОтличияАктивов);	
				КонецЕсли;
			КонецЕсли;				
			
			Если НаборРасхождений = Неопределено ИЛИ НаборРасхождений.Свойство("ОтличияЦБ") Тогда
				РезультатПроверки.Вставить("ОтличияЦБ", НаборыДанных.ОтличияЦБ.Скопировать());
				РезультатПроверки.ОтличияЦБ.Колонки.Добавить("СчетДоверительногоУправления", Клиенты.Колонки["СчетДоверительногоУправления"].ТипЗначения);
				РезультатПроверки.ОтличияЦБ.Колонки.Добавить("Дата", Клиенты.Колонки["Дата"].ТипЗначения);
				РезультатПроверки.ОтличияЦБ.ЗаполнитьЗначения(ТекСтрока.СчетДоверительногоУправления, "СчетДоверительногоУправления");
				РезультатПроверки.ОтличияЦБ.ЗаполнитьЗначения(ТекСтрока.Дата, "Дата");		
				
				Если ОбщиеНаборыДанных.Свойство("ОтличияЦБ") Тогда
					РаботаСКоллекциями.ТаблицаЗначений_Дополнить(РезультатПроверки.ОтличияЦБ, ОбщиеНаборыДанных.ОтличияЦБ); 			
				Иначе
					ОбщиеНаборыДанных.Вставить("ОтличияЦБ", РезультатПроверки.ОтличияЦБ);	
				КонецЕсли;
			КонецЕсли;
			
			Если НаборРасхождений = Неопределено ИЛИ НаборРасхождений.Свойство("ОтличияПрочихЦБ") Тогда
				РезультатПроверки.Вставить("ОтличияПрочихЦБ", НаборыДанных.ОтличияПрочихЦБ.Скопировать());
				РезультатПроверки.ОтличияПрочихЦБ.Колонки.Добавить("СчетДоверительногоУправления", Клиенты.Колонки["СчетДоверительногоУправления"].ТипЗначения);
				РезультатПроверки.ОтличияПрочихЦБ.Колонки.Добавить("Дата", Клиенты.Колонки["Дата"].ТипЗначения);
				РезультатПроверки.ОтличияПрочихЦБ.ЗаполнитьЗначения(ТекСтрока.СчетДоверительногоУправления, "СчетДоверительногоУправления");
				РезультатПроверки.ОтличияПрочихЦБ.ЗаполнитьЗначения(ТекСтрока.Дата, "Дата");		
				
				Если ОбщиеНаборыДанных.Свойство("ОтличияПрочихЦБ") Тогда
					РаботаСКоллекциями.ТаблицаЗначений_Дополнить(РезультатПроверки.ОтличияПрочихЦБ, ОбщиеНаборыДанных.ОтличияПрочихЦБ); 			
				Иначе
					ОбщиеНаборыДанных.Вставить("ОтличияПрочихЦБ", РезультатПроверки.ОтличияПрочихЦБ);	
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	
	
	ДокументРезультат = Обработки.КонтрольСЧА.СформироватьТабличныйДокумент(ОбщиеНаборыДанных);	
	
	ДокументРезультат.ОтображатьЗаголовки	= Ложь;
	ДокументРезультат.ОтображатьСетку		= Ложь;	
	
	Возврат ДокументРезультат;	
	
КонецФункции

&НаКлиенте
Процедура УстановитьПометкуМенюСокрытияСтрокБезРасхождений(ПунктМеню = Неопределено)
	
	ЕстьОтбор = Ложь;	
	
	Для Каждого ЭлементМеню Из Элементы.РезультатыПроверкиГруппаСкрытьСтроки.ПодчиненныеЭлементы Цикл
		Если ЭлементМеню = ПунктМеню Тогда
			ЭлементМеню.Пометка = Не ЭлементМеню.Пометка;
		Иначе
			ЭлементМеню.Пометка = Ложь;
		КонецЕсли;
		
		ЕстьОтбор = ЕстьОтбор ИЛИ ЭлементМеню.Пометка;
	КонецЦикла;
	
	Элементы.РезультатыПроверкиГруппаСкрытьСтроки.Картинка = ?(ЕстьОтбор, БиблиотекаКартинок.ОтключитьОтбор16, БиблиотекаКартинок.ОтборПоТекущемуЗначению);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСтрокБезРасхождений()

	ОтборСтрок = Новый Структура;

	Если Элементы.РезультатыПроверкиСкрытьСтрокиБезРасхождений.Пометка Тогда
		ОтборСтрок.Вставить("ЕстьОшибки", Истина);
	ИначеЕсли Элементы.РезультатыПроверкиСкрытьСтрокиБезРасхожденийВАктивах.Пометка Тогда
		ОтборСтрок.Вставить("ЕстьОшибкиВАктивах", Истина);
	ИначеЕсли Элементы.РезультатыПроверкиСкрытьСтрокиБезРасхожденийВЦБ.Пометка Тогда
		ОтборСтрок.Вставить("ЕстьОшибкиВЦБ", Истина);		
	ИначеЕсли Элементы.РезультатыПроверкиСкрытьСтрокиБезРасхожденийФинансовыхПоказателей.Пометка Тогда
		ОтборСтрок.Вставить("ЕстьОшибкиЗарегистрированныхЗначений", Истина);		
	КонецЕсли;
	
	Элементы.РезультатыПроверки.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАдресЭлектроннойПочтыТекущегоПользователя()
	
	ТекущийПользователь = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущийПользователь");	
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийПользователь, "АдресЭлектроннойПочты");  	
	
КонецФункции
	
&НаКлиенте
Процедура ПриИзмененииПараметровОтправкиРезультатовНаПочту()
	
	Если ЭтаФорма.ОтправитьРезультатыНаПочту Тогда
		ЗаголовокГруппы = "Получатель результатов: ";
		
		Если ПустаяСтрока(ЭтаФорма.АдресЭлектроннойПочты) Тогда
			ЗаголовокГруппы = ЗаголовокГруппы + "<Получатель не задан>";			
		Иначе
			ЗаголовокГруппы = ЗаголовокГруппы + ЭтаФорма.АдресЭлектроннойПочты;			
		КонецЕсли;			
	Иначе
		ЗаголовокГруппы = "Настройки отправки результатов";	
	КонецЕсли;
	
	Элементы.ГруппаОтправкаРезультатов.Заголовок = ЗаголовокГруппы;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстСообщения = "";
	
	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Объект.ПериодКонтроля,,, ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Объект.ПериодКонтроля", Отказ); 	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
